{
  "common": {
    "name": "ems-esp",
    "version": "3.5.0",
    "news": {
      "3.5.0": {
        "en": "warm water starts not supported anymore within statistics due to namechanges within ems-esp firmware 3.7",
        "de": "warmes wasser beginnt nicht mehr innerhalb von statistiken aufgrund von namensänderungen in ems-esp firmware 3.7 unterstützt",
        "ru": "теплая вода больше не поддерживается в статистике из-за изменений названия в ems-esp прошивки 3.7",
        "pt": "água quente começa não suportado mais dentro de estatísticas devido a alterações de nome dentro ems-esp firmware 3.7",
        "nl": "warm water begint niet meer ondersteund binnen statistieken als gevolg van naamwijzigingen binnen ems-esp firmware 3.7",
        "fr": "eau chaude ne commence plus pris en charge dans les statistiques en raison des changements de nom au sein du firmware ems-esp 3.7",
        "it": "acqua calda non inizia più supportato all'interno delle statistiche a causa dei cambi di nome all'interno del firmware ems-esp 3.7",
        "es": "agua tibia comienza ya no soportada dentro de las estadísticas debido a cambios de nombre dentro de ems-esp firmware 3.7",
        "pl": "ciepła woda zaczyna nie wspierane już w statystykach ze względu na nazwy w ems- esp firmware 3.7",
        "uk": "тепла вода не підтримується в будь-який час в статистиці завдяки обміну повідомленнями в е-esp прошивці 3.7",
        "zh-cn": "由于ems-esp固件3.7中的名称变化,在统计中不再支持暖水"
      },
      "3.4.4": {
        "en": "improve delays between axios get requests for km200 and ems-esp to avoid errors",
        "de": "verbesserung der verzögerungen zwischen axios erhalten anfragen für km200 und ems-esp, um fehler zu vermeiden",
        "ru": "улучшить задержки между axios получать запросы на км200 и ems-esp, чтобы избежать ошибок",
        "pt": "melhorar os atrasos entre axios obter pedidos de km200 e ems-esp para evitar erros",
        "nl": "verbeteren van vertragingen tussen axio's krijgen verzoeken voor km200 en ems-esp om fouten te voorkomen",
        "fr": "améliorer les délais entre axios obtenir des demandes pour km200 et ems-esp pour éviter les erreurs",
        "it": "migliorare i ritardi tra assio ottenere richieste per km200 e ems-esp per evitare errori",
        "es": "mejorar los retrasos entre axios obtener solicitudes de km200 y ems-esp para evitar errores",
        "pl": "poprawić opóźnienia między aksjonami uzyskać wnioski o km200 i ems- esp, aby uniknąć błędów",
        "uk": "поліпшення затримок між axios отримувати запити на км200 і емс-есп, щоб уникнути помилок",
        "zh-cn": "改善轴之间的延迟 获取 km200 和 ems- esp 的请求以避免错误"
      },
      "3.4.3": {
        "en": "corrections for reading gateway data for km200 gateway",
        "de": "korrekturen zum lesen von gateway-daten für km200 gateway",
        "ru": "исправления для чтения данных шлюза km200",
        "pt": "correções para ler dados de gateway para o gateway km200",
        "nl": "correcties voor het lezen van gatewaygegevens voor km200 gateway",
        "fr": "corrections pour la lecture des données de passerelle pour la passerelle km200",
        "it": "correzioni per la lettura dei dati del gateway per il gateway km200",
        "es": "correcciones para la lectura de los datos de la puerta de entrada de km200",
        "pl": "korekty dotyczące odczytu danych bramki dla bramki km200",
        "uk": "корекція для читання даних шлюзу на км200",
        "zh-cn": "km200网关读取网关数据的更正"
      },
      "3.4.2": {
        "en": "update dependencies\nreplace setTimeout by adapter.delay",
        "de": "aktualisierung der abhängigkeiten\nersetzen Set Timeout per Adapter. Verzögerung",
        "ru": "обновление зависимостей\nзаменить Время за адаптером. отсрочка",
        "pt": "dependências\nsubstituir o conjunto Timeout por adaptador. atraso",
        "nl": "afhankelijkheden bijwerken\nvervangen set Timeout door adapter. vertraging",
        "fr": "mettre à jour les dépendances\nremplacer l'ensemble Temps mort par adaptateur. retard",
        "it": "aggiornamento dipendenze\nset di sostituzione Timeout per adattatore. ritardo",
        "es": "dependencias de actualización\nreemplazado Timeout por adaptador. demora",
        "pl": "aktualizacji zależności\nzestaw zastępczy Przerwa przez adapter. opóźnienie",
        "uk": "оновлення залежності\nзамінний набір Розклад за допомогою адаптера. затримка",
        "zh-cn": "更新依赖关系\n替换集 适配器暂停. 延迟"
      },
      "3.4.1": {
        "en": "correct enum settings for ems-esp gateway on adapter start",
        "de": "korrekte enum-einstellungen für ems-esp-gateway auf adapterstart",
        "ru": "правильные настройки ems-esp для адаптера",
        "pt": "configurações enum corretas para gateway ems-esp no início do adaptador",
        "nl": "correcte enum instellingen voor ems-esp gateway op adapterstart",
        "fr": "corrects paramètres enum pour la passerelle ems-esp au démarrage de l'adaptateur",
        "it": "impostazioni enum corrette per il gateway ems-esp all'inizio dell'adattatore",
        "es": "ajustes de enum correctos para la entrada ems-esp en el arranque del adaptador",
        "pl": "prawidłowe ustawienia enum dla bramki ems- esp przy uruchomieniu adaptera",
        "uk": "виправлено налаштування емс-esp шлюзу на старті адаптера",
        "zh-cn": "适配器启动时 ems- esp 网关的正确enum 设置"
      },
      "3.4.0": {
        "en": "changes for ems-esp firmware 3.7.0 \nintroduce warnings in log for using ems-esp dev firmware",
        "de": "änderungen für ems-esp firmware 3.7.0\nwarnhinweise in log für die verwendung von ems-esp dev firmware",
        "ru": "изменения для ems-esp прошивки 3.7.0\nввести предупреждения в журнале для использования ems-esp dev прошивки",
        "pt": "alterações para firmware ems-esp 3.7.0\nintroduzir avisos no log para usar ems-esp dev firmware",
        "nl": "wijzigingen voor ems-esp firmware 3.7.0\ninvoering van waarschuwingen in log voor het gebruik van ems-esp dev firmware",
        "fr": "changements pour ems-esp firmware 3.7.0\nintroduire des avertissements dans le journal pour l'utilisation du firmware ems-esp dev",
        "it": "modifiche per firmware ems-esp 3.7.0\nintrodurre avvisi in log per l'utilizzo del firmware ems-esp dev",
        "es": "cambios para el firmware de emsp 3.7.0\nintroducir advertencias en el registro para utilizar ems-esp dev firmware",
        "pl": "zmiany oprogramowania firmowego ems- esp 3.7.0\nwprowadzić ostrzeżenia w dzienniku dla korzystania z ems- esp dev firmware",
        "uk": "зміни для прошивки ems-esp 3.7.0\nвводити попередження в журнал для використання прошивок ems-esp dev",
        "zh-cn": "ems-esp固件的变化 3.7.0\n在日志中引入使用 ems-esp dev 固件的警告"
      },
      "3.3.0": {
        "en": "introduce a new check for ems-esp gateway formatting settings for boolean and enum values\nstop ems-esp polling if wrong settings are detected !",
        "de": "eine neue überprüfung für ems-esp-gateway-formatierung einstellungen für boolean und enum werte\nstoppen sie die ems-esp-umfrage, wenn falsche einstellungen erkannt werden !",
        "ru": "ввести новую проверку параметров форматирования ems-esp для болеинов и энумов\nостановите опрос ems-esp, если будут обнаружены неправильные настройки!",
        "pt": "introduzir uma nova verificação para configurações de formatação de gateway ems-esp para valores booleanos e enum\nparar a votação ems-esp se as configurações erradas forem detectadas!",
        "nl": "voert een nieuwe controle voor ems-esp gateway formatting instellingen voor booleaanse en enum waarden\nstop met ems-esp polling als er verkeerde instellingen worden gedetecteerd!",
        "fr": "introduire une nouvelle vérification des paramètres de formatage de passerelle ems-esp pour les valeurs booléennes et enum\narrêtez le vote ems-esp si de mauvais réglages sont détectés !",
        "it": "introdurre un nuovo controllo per le impostazioni di formattazione del gateway ems-esp per i valori boolean ed enum\narrestare ems-esp polling se vengono rilevate impostazioni sbagliate!",
        "es": "introducir un nuevo cheque para la configuración de formato de portal ems-esp para valores booleanos y enum\ndetener la encuesta de ems-esp si se detectan ajustes incorrectos!",
        "pl": "wprowadzić nowy sprawdzian dla ustawień formatowania bramki ems- esp dla wartości boolean i enum\nzatrzymać ems- esp sondażu, jeśli wykryto błędne ustawienia!",
        "uk": "впровадити нову перевірку на налаштування форматування шлюзу емс-esp для boolean та enum значення\nзупинити емс-esp опитування, якщо виявляються неправильні налаштування !",
        "zh-cn": "为 布尔值和 enum 值引入 ems- esp 网关格式化设置的新检查\n如果发现设置错误, 请停止投票 !"
      }
    },
    "titleLang": {
      "en": "EMS-ESP (ems-esp & km200)",
      "de": "EMS-ESP (ems-esp & km200)",
      "ru": "EMS-ESP (ems-esp и km200)",
      "pt": "EMS-ESP (ems-esp & km200)",
      "nl": "EMS-ESP (ems-esp & km200)",
      "fr": "EMS-ESP (EMS-ESP & km200)",
      "it": "EMS-ESP (ems-esp e km200)",
      "es": "EMS-ESP (ems-esp y km200)",
      "pl": "EMS-ESP (ems-esp i km200)",
      "uk": "EMS-ESP (ems-esp & км200)",
      "zh-cn": "EMS-ESP (ems-esp & km200)"
    },
    "desc": {
      "en": "EMS (Energy Management System) based equipment from manufacturers like Bosch, Buderus, Nefit, Junkers, Worcester and Sieger.",
      "de": "EMS (Energy Management System) basierte Geräte von Herstellern wie Bosch, Buderus, Nefit, Junkers, Worcester und Sieger.",
      "ru": "Оборудование на базе EMS (системы управления энергопотреблением) от таких производителей, как Bosch, Buderus, Nefit, Junkers, Worcester и Sieger.",
      "pt": "Equipamentos baseados em EMS (Sistema de Gerenciamento de Energia) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "nl": "Op EMS (Energy Management System) gebaseerde apparatuur van fabrikanten als Bosch, Buderus, Nefit, Junkers, Worcester en Sieger.",
      "fr": "Équipements basés sur EMS (Energy Management System) de fabricants tels que Bosch, Buderus, Nefit, Junkers, Worcester et Sieger.",
      "it": "Apparecchiature basate su EMS (Energy Management System) di produttori come Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "es": "Equipos basados en EMS (Energy Management System) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester y Sieger.",
      "pl": "Sprzęt oparty na EMS (Energy Management System) takich producentów jak Bosch, Buderus, Nefit, Junkers, Worcester i Sieger.",
      "uk": "EMS (Система енергоменеджменту) на основі обладнання від виробників, таких як Bosch, Buderus, Nefit, Junkers, Worcester та Sieger.",
      "zh-cn": "来自 Bosch、Buderus、Nefit、Junkers、Worcester 和 Sieger 等制造商的基于 EMS（能源管理系统）的设备。"
    },
    "authors": [
      "Thomas Petrick <tp1degit@gmail.com>"
    ],
    "keywords": [
      "ems-esp",
      "Buderus",
      "Bosch",
      "Junkers",
      "Netfit",
      "Sieger",
      "Worcester",
      "km200",
      "central heating",
      "smarthome"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "tier": 2,
    "icon": "ems-esp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/tp1de/ioBroker.ems-esp/main/admin/ems-esp.png",
    "readme": "https://github.com/tp1de/ioBroker.ems-esp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "stopTimeout": 1000,
    "dataFolder": "ems-esp.%INSTANCE%",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=4.0.24"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.13.16"
      }
    ]
  },
  "encryptedNative": [
    "private_pw"
  ],
  "protectedNative": [
    "private_pw"
  ],
  "native": {
    "password": "",
    "control_file": "*",
    "km200_active": false,
    "km200_ip": "http://192.168.178.x",
    "km200_polling": 300,
    "km200_entry": "",
    "gateway_pw": "",
    "emsesp_active": true,
    "emsesp_ip": "http://ems-esp",
    "ems_apiv3": true,
    "ems_http_wait": 100,
    "ems_poll_wait": 500,
    "ems_token": "",
    "ems_polling": 60,
    "ems_dallas": false,
    "ems_dallas_old_format": false,
    "ems_analog": false,
    "ems_custom": false,
    "ems_custom_elements": false,
    "ems_energy": false,
    "ems_nominalpower": 15,
    "ems_modulation": "boiler.curburnpow",
    "ems_wwactive": "boiler.wwcharging",
    "recordings": false,
    "recordings_format": 0,
    "r_multi": 1,
    "r_month": true,
    "r_c": true,
    "statistics": false,
    "db": "",
    "db_instance": 0,
    "database": "iobroker",
    "km200_structure": false,
    "eff_active": false,
    "eff20": 109.4,
    "eff25": 109.3,
    "eff30": 108.3,
    "eff35": 108,
    "eff40": 106.5,
    "eff45": 105.2,
    "eff50": 103,
    "eff55": 100,
    "eff60": 98,
    "eff70": 97,
    "syslog": false,
    "syslog_port": 20516,
    "states_reorg": false,
    "heatdemand": false,
    "modulation": "",
    "supplytemp": "",
    "returntemp": "",
    "room": "boiler_room",
    "function": "heating",
    "devices": []
  },
  "objects": [],
  "instanceObjects": []
}
