{
  "common": {
    "name": "ems-esp",
    "version": "2.6.3",
    "news": {
      "2.6.3": {
        "en": "Update dependencies",
        "de": "Abhängigkeiten aktualisieren",
        "ru": "Обновить зависимости",
        "pt": "Dependências de atualização",
        "nl": "Update afhankelijkheid",
        "fr": "Mettre à jour les dépendances",
        "it": "Dipendenze di aggiornamento",
        "es": "Actualizar las dependencias",
        "pl": "Zależności aktualnej",
        "uk": "Оновлення залежності",
        "zh-cn": "最新依赖"
      },
      "2.6.2": {
        "en": "correct notifications and systeminfo for km200",
        "de": "korrekte benachrichtigungen und systeminfo für km200",
        "ru": "правильные уведомления и системаinfo для km200",
        "pt": "notificações corretas e systeminfo para km200",
        "nl": "vertaling:",
        "fr": "notifications correctes et systeminfo pour km200",
        "it": "notifiche corrette e systeminfo per km200",
        "es": "notificaciones correctas y systeminfo para km200",
        "pl": "poprawne noty i informacja systemowa na km200",
        "uk": "правильні повідомлення та системаinfo для км200",
        "zh-cn": "正确通知和系统4 200公里"
      },
      "2.6.1": {
        "en": "Avoid crash on adapter start while delete states is used in parameters",
        "de": "Vermeiden Sie Crash auf Adapterstart, während Löschzustände in Parametern verwendet werden",
        "ru": "Избегайте аварии на запуске адаптера, пока удалять штаты используются в параметрах",
        "pt": "Evite falhas no início do adaptador enquanto elimina estados é usado em parâmetros",
        "nl": "Vermijd een ongeluk op adapter start terwijl de staat wordt gebruikt in parameters",
        "fr": "Éviter le démarrage de l'adaptateur pendant que supprimer les états est utilisé dans les paramètres",
        "it": "Evitare il crash sull'avvio dell'adattatore mentre eliminare gli stati viene utilizzato nei parametri",
        "es": "Evite el fallo en el inicio del adaptador mientras que los estados borrados se utilizan en parámetros",
        "pl": "Zanieczyszczona katastrofa na początku adaptatora, podczas gdy usunięte stany są używane w parametrach",
        "uk": "Уникайте аварійного запуску адаптера при видаленні станів використовується в параметрах",
        "zh-cn": "在适应人员开端时用了一张防弹事故,而删除的州在参数中使用。"
      },
      "2.6.0": {
        "en": "Add indicator for connection status of the gateways within instances overview",
        "de": "Anzeige für den Verbindungsstatus der Gateways innerhalb der Instanzenübersicht hinzufügen",
        "ru": "Добавьте индикатор для состояния соединения шлюзов в обзор инстанций",
        "pt": "Adicionar indicador para status de conexão dos gateways dentro da visão geral das instâncias",
        "nl": "Advocaat indicator voor connectiestatus van de poort binnen de instanties",
        "fr": "Ajouter un indicateur pour l'état de connexion des passerelles dans les instances aperçu",
        "it": "Aggiungi indicatore per lo stato di connessione dei gateway all'interno della panoramica delle istanze",
        "es": "Añadir indicador para el estado de conexión de las pasarelas dentro de las instancias",
        "pl": "Addd indicator for connection state of the gateways in cases of overview",
        "uk": "Додавання індикатора стану підключення шлюзів в огляді екземплярів",
        "zh-cn": "在总括范围内增加大门连接状况的指标"
      },
      "2.5.3": {
        "en": "Replace axios post by axios put for KM200 gateway to secure that write changes are accepted",
        "de": "Ersetzen axios post von axios für KM200 Gateway gesetzt, um sicherzustellen, dass Schreibänderungen akzeptiert werden",
        "ru": "Замените axios post by axios положить для KM200 шлюз, чтобы обеспечить, что пишите изменения принимаются",
        "pt": "Substitua axios post por axios colocado para gateway KM200 para garantir que as alterações de gravação são aceitas",
        "nl": "Vertaling:",
        "fr": "Remplacer le poste axios par axios mis pour passerelle KM200 pour s'assurer que les changements d'écriture sont acceptés",
        "it": "Sostituire l'assios post da assios messo per KM200 gateway per garantire che i cambiamenti di scrittura sono accettati",
        "es": "Reemplazar el puesto de axios por eje puesto para la puerta de KM200 para asegurar que los cambios de escritura son aceptados",
        "pl": "Replace axios post by axios put for the KM200 gateway to secure the write changes (ang.)",
        "uk": "Замініть аксіо-пошту аксіосом, щоб забезпечити, що записуються зміни приймаються",
        "zh-cn": "将KM200门路的焦虑员额改为一个蓝图,以确保接受修改。"
      },
      "2.5.2": {
        "en": "Update energy statistics and recordings for history and influxdb\ninclude warning in log that InfluxDB V2 will not be supported in future versions anymore",
        "de": "Aktualisierung von Energiestatistiken und -aufnahmen für Geschichte und Influxdb\nenthalten Warnung in Protokoll, dass InfluxDB V2 in zukünftigen Versionen nicht mehr unterstützt wird",
        "ru": "Обновить энергетическую статистику и записи для истории и influxdb\nвключить предупреждение в лог, что InfluxDB V2 больше не будет поддерживаться в будущих версиях",
        "pt": "Atualizar estatísticas de energia e gravações para história e influuxdb\nincluir aviso no log que o InfluxDB V2 não será suportado em versões futuras",
        "nl": "Update energie statistieken en opnames voor geschiedenis en influxdb\nin het logboek dat InfluxDB V2 niet meer zal worden ondersteund in toekomstige versies",
        "fr": "Mettre à jour les statistiques énergétiques et les enregistrements pour l'histoire et l'influxdb\ninclure l'avertissement dans le journal que InfluxDB V2 ne sera plus supporté dans les versions futures",
        "it": "Aggiornare le statistiche e le registrazioni energetiche per la storia e l'afflusso\nincludere avviso nel registro che InfluxDB V2 non sarà più supportato nelle versioni future",
        "es": "Actualizar estadísticas y grabaciones energéticas para historia e influxdb\nincluir la advertencia en el registro de que InfluxDB V2 ya no será compatible en versiones futuras",
        "pl": "Dane statystyczne i nagrania dla historii i napływu\ninfluxDB V2 nie będzie wspierana w przyszłych wersjach",
        "uk": "Оновити статистику та записи для історії та інфлюкс\nввімкніть попередження в журналі, який InfluxDB V2 не буде підтримуватися в наступних версіях",
        "zh-cn": "二. 最新能源统计和历史和流感记录\n包括警告,在今后版本中不会支持流落街头的第五2行。"
      },
      "2.5.1": {
        "en": "correct hourly recordings timestamps for km200 (timezone difference)",
        "de": "korrekte stundenaufnahmen zeitstempel für km200 (zeitzone differenz)",
        "ru": "правильные почасовые записи временные метки для км200 (разница часового пояса)",
        "pt": "tempos livres para km200 (diferença de fuso horário)",
        "nl": "vertaling:",
        "fr": "enregistrements horaires corrects pour le km200 (écart de fuseau horaire)",
        "it": "corretto ore di registrazione timestamp per km200 (differenza di fuso orario)",
        "es": "horaria correcta grabaciones timetamps para km200 ( diferencia horaria)",
        "pl": "poprawne nagranie o długości geograficznej na km200 (różnice czasowe)",
        "uk": "правильного часу записує часові запаси на км200 (різниця денногозону)",
        "zh-cn": "正确地记录200公里(区差异)的时间限制"
      }
    },
    "titleLang": {
      "en": "EMS-ESP (ems-esp & km200)",
      "de": "EMS-ESP (ems-esp & km200)",
      "ru": "EMS-ESP (ems-esp и km200)",
      "pt": "EMS-ESP (ems-esp & km200)",
      "nl": "EMS-ESP (ems-esp & km200)",
      "fr": "EMS-ESP (EMS-ESP & km200)",
      "it": "EMS-ESP (ems-esp e km200)",
      "es": "EMS-ESP (ems-esp y km200)",
      "pl": "EMS-ESP (ems-esp i km200)",
      "uk": "EMS-ESP (ems-esp & км200)",
      "zh-cn": "EMS-ESP (ems-esp & km200)"
    },
    "desc": {
      "en": "EMS (Energy Management System) based equipment from manufacturers like Bosch, Buderus, Nefit, Junkers, Worcester and Sieger.",
      "de": "EMS (Energy Management System) basierte Geräte von Herstellern wie Bosch, Buderus, Nefit, Junkers, Worcester und Sieger.",
      "ru": "Оборудование на базе EMS (системы управления энергопотреблением) от таких производителей, как Bosch, Buderus, Nefit, Junkers, Worcester и Sieger.",
      "pt": "Equipamentos baseados em EMS (Sistema de Gerenciamento de Energia) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "nl": "Op EMS (Energy Management System) gebaseerde apparatuur van fabrikanten als Bosch, Buderus, Nefit, Junkers, Worcester en Sieger.",
      "fr": "Équipements basés sur EMS (Energy Management System) de fabricants tels que Bosch, Buderus, Nefit, Junkers, Worcester et Sieger.",
      "it": "Apparecchiature basate su EMS (Energy Management System) di produttori come Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "es": "Equipos basados en EMS (Energy Management System) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester y Sieger.",
      "pl": "Sprzęt oparty na EMS (Energy Management System) takich producentów jak Bosch, Buderus, Nefit, Junkers, Worcester i Sieger.",
      "uk": "EMS (Система енергоменеджменту) на основі обладнання від виробників, таких як Bosch, Buderus, Nefit, Junkers, Worcester та Sieger.",
      "zh-cn": "来自 Bosch、Buderus、Nefit、Junkers、Worcester 和 Sieger 等制造商的基于 EMS（能源管理系统）的设备。"
    },
    "authors": [
      "Thomas Petrick <tp1degit@gmail.com>"
    ],
    "keywords": [
      "ems-esp",
      "Buderus",
      "Bosch",
      "Junkers",
      "Netfit",
      "Sieger",
      "Worcester",
      "km200",
      "central heating",
      "smarthome"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "icon": "ems-esp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/tp1de/ioBroker.ems-esp/main/admin/ems-esp.png",
    "readme": "https://github.com/tp1de/ioBroker.ems-esp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "materialize": true,
    "connectionType": "local",
    "stopTimeout": 1000,
    "dataFolder": "ems-esp.%INSTANCE%",
    "dataSource": "poll",
    "dependencies": [
      {
        "js-controller": ">=4.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=4.0.9"
      }
    ]
  },
  "encryptedNative": [
    "private_pw"
  ],
  "protectedNative": [
    "private_pw"
  ],
  "native": {
    "password": "",
    "control_file": "*",
    "km200_active": false,
    "km200_ip": "http://192.168.178.x",
    "km200_polling": 300,
    "km200_entry": "",
    "gateway_pw": "",
    "emsesp_active": true,
    "emsesp_ip": "http://ems-esp",
    "ems_apiv3": true,
    "ems_http_wait": 100,
    "ems_poll_wait": 500,
    "ems_token": "",
    "ems_polling": 60,
    "ems_dallas": false,
    "ems_dallas_old_format": false,
    "ems_analog": false,
    "ems_custom": false,
    "ems_custom_elements": false,
    "ems_energy": false,
    "ems_nominalpower": 15,
    "ems_modulation": "boiler.curburnpow",
    "ems_wwactive": "boiler.wwcharging",
    "recordings": false,
    "recordings_format": 0,
    "r_multi": 1,
    "r_month": true,
    "r_c": true,
    "statistics": false,
    "db": "",
    "db_instance": 0,
    "database": "iobroker",
    "km200_structure": false,
    "eff_active": false,
    "eff20": 109.4,
    "eff25": 109.3,
    "eff30": 108.3,
    "eff35": 108,
    "eff40": 106.5,
    "eff45": 105.2,
    "eff50": 103,
    "eff55": 100,
    "eff60": 98,
    "eff70": 97,
    "syslog": false,
    "syslog_port": 20516,
    "states_reorg": false,
    "heatdemand": false,
    "modulation": "",
    "supplytemp": "",
    "returntemp": "",
    "room": "boiler_room",
    "function": "heating",
    "devices": []
  },
  "objects": [],
  "instanceObjects": []
}
