{
  "common": {
    "name": "ems-esp",
    "version": "4.1.3",
    "news": {
      "4.1.3": {
        "en": "fix crash on wrong ems-esp ip address",
        "de": "crash auf falsche ems-esp ip adresse beheben",
        "ru": "исправить крушение на неправильный адрес ems-esp",
        "pt": "corrigir acidente no endereço ems-esp ip errado",
        "nl": "fix crash op verkeerde ems-esp ip adres",
        "fr": "correction de l'écrasement sur la mauvaise adresse ems-esp ip",
        "it": "fissare l'incidente sull'indirizzo ems-esp ip sbagliato",
        "es": "arreglar fallo en la dirección equivocada ems-esp ip",
        "pl": "naprawić awarię na złym adresie ems- esp ip",
        "uk": "виправлення аварійної аварії на неправильній е-esp ip-адресі",
        "zh-cn": "固定错误的 ems- esp ip 地址上的崩溃"
      },
      "4.1.2": {
        "en": "km200 private password might has to be re-entered\nupdate dependencies (dependabot)",
        "de": "km200 privates passwort muss neu eingesehen werden\naktualisierung abhängigkeiten (dependabot)",
        "ru": "частный пароль km200 может быть повторно введен\nобновление зависимостей (dependabot)",
        "pt": "km200 senha privada pode ter que ser reentrada\ndependências de atualização (dependabot)",
        "nl": "km200 privé-wachtwoord moet mogelijk opnieuw ingevoerd worden\nafhankelijkheden bijwerken (dependabot)",
        "fr": "km200 mot de passe privé peut devoir être réintroduit\nmettre à jour les dépendances (dependabot)",
        "it": "km200 password privata potrebbe essere rientro\naggiornamento dipendenze (dependabot)",
        "es": "km200 contraseña privada podría tener que volver a entrar\ndependencias de actualización (dependabot)",
        "pl": "km200 prywatne hasło może być wprowadzone ponownie\naktualizacji zależności (zależności)",
        "uk": "km200 приватний пароль може бути перероблений\nоновлення залежностей",
        "zh-cn": "km200 私人密码可能要重新输入\n更新依赖性( 依赖性)"
      },
      "4.1.1": {
        "en": "corrections in io-package.json",
        "de": "korrekturen in io-package.json",
        "ru": "исправления в io-package.json",
        "pt": "correções em io-package.json",
        "nl": "correcties in jo-package.json",
        "fr": "corrections dans io-package.json",
        "it": "correzioni in io-package.json",
        "es": "correcciones en io-package.json",
        "pl": "korekty w jo- package.json",
        "uk": "корекція в io-package.json",
        "zh-cn": "o-package.json中的更正"
      },
      "4.1.0": {
        "en": "BREAKING CHANGES\nuse statepicker for jsonConfig (ems-esp energy statistics, boiler efficiency and heating demand)\nnew file location for km200.csv file -- breaking change\nold file location for km200.csv file(s) will be deleted by adapter\nnew content for selection of database within parameters tab - adpters tries to convert, but please check.",
        "de": "VERÄNDERUNGEN\nverwendung von statepicker für jsonConfig (Ems-esp-Energiestatistik, Kesseleffizienz und Heizbedarf)\nneue datei-standort für km200.csv-datei -- änderung ändern\nalter dateiort für km200.csv datei(en) wird durch adapter gelöscht\nneue inhalte für die auswahl der datenbank innerhalb der parameter tab - adpter versucht zu konvertieren, aber bitte überprüfen.",
        "ru": "ИЗМЕНЕНИЯ\nиспользование statepicker для jsonConfig (статистика энергии эмс-эсп, эффективность котла и спрос на отопление)\nновое местоположение файла km200.csv - смена\nстарое местоположение файла km200.csv будет удалено адаптером\nновый контент для выбора базы данных в вкладке параметров - рекламодатели пытаются конвертировать, но пожалуйста, проверьте.",
        "pt": "ALTERAÇÕES DE TRABALHO\nuso de statepicker para jsonConfig (ems-esp estatísticas de energia, eficiência da caldeira e demanda de aquecimento)\nnova localização do arquivo para km200.csv -- quebra mudança\nlocalização de arquivo antigo para km200.csv arquivo(s) será excluído pelo adaptador\nnovo conteúdo para a seleção de banco de dados dentro da guia parâmetros - adpters tenta converter, mas verifique por favor.",
        "nl": "BEREIDINGSVERANDERINGEN\ngebruik statepicker voor jsonConfig (ems-esp energiestatistieken, ketelefficiëntie en verwarmingsvraag)\nnieuwe bestandslocatie voor km200.csv-bestand -- verandering breken\noude bestand locatie voor km200.csv bestand(s) zal worden verwijderd door adapter\nnieuwe inhoud voor de selectie van database binnen parameters tab - adpters probeert om te zetten, maar controleer.",
        "fr": "CHANGEMENTS\nutiliser Statepicker pour jsonConfig (statistiques énergétiques de l'esp, efficacité des chaudières et demande de chauffage)\nnouvel emplacement du fichier km200.csv -- casser le changement\nancien emplacement du fichier pour km200.csv fichier(s) sera supprimé par adaptateur\nnouveau contenu pour la sélection de la base de données dans l'onglet paramètres - adpters tente de convertir, mais veuillez vérifier.",
        "it": "VARIAZIONI\nutilizzare statepicker per jsonConfig (statistiche sull'energia, efficienza caldaia e domanda di riscaldamento)\nnuova posizione del file per il file km200.csv -- rottura cambiamento\nvecchia posizione del file per km200.csv file(s) verrà cancellato dall'adattatore\nnuovo contenuto per la selezione di database all'interno della scheda parametri - gli inserzionisti tenta di convertire, ma si prega di controllare.",
        "es": "BREAKING CHANGS\nuse statepicker para jsonConfig (ems-esp estadísticas de energía, eficiencia de caldera y demanda de calefacción)\nnueva ubicación de archivo para el archivo km200.csv -- cambio de ruptura\nantigua ubicación de archivo para km200.csv archivo(s) se eliminará por adaptador\nnuevo contenido para la selección de la base de datos dentro de la pestaña de parámetros - adpters intenta convertir, pero por favor compruebe.",
        "pl": "ZMIANY ZBIORCZE\nużywać statepicker dla jsonConfig (ems- esp statystyki energii, wydajność kotła i zapotrzebowanie na ogrzewanie)\nnowa lokalizacja pliku dla pliku km200.csv -- zmiana\nstare położenie pliku dla plików km200.csv zostanie usunięte przez adapter\nnowa zawartość do wyboru bazy danych w karcie parametrów - additives próbuje przekonwertować, ale proszę sprawdzić.",
        "uk": "БРЕАКІНГОВІ ЗМІНИ\nвикористовуйте шпикер для jsonConfig (випадок енергії, ефективність котла та попит на опалення)\nновий файл розташування для км200.csv файл -- зміна перерву\nстарий файл розташування для км200.csv файл(s) буде видалено за допомогою адаптера\nновий вміст для вибору бази даних в вкладці параметрів - рекламні оголошення намагаються конвертувати, але будь ласка, перевірте.",
        "zh-cn": "裂变\njsonConfig(电力统计、锅炉效率和供热需求)\nkm200.csv 文件的新文件位置 -- 打破更改\nkm200.csv 文件的旧文件位置将被适配器删除\n参数标签内选择数据库的新内容 - 插件尝试转换, 但请检查 ."
      },
      "4.0.1": {
        "en": "jsonConfig optimization for tablets and medium resolution screens",
        "de": "jsonConfig-Optimierung für Tablets und Bildschirme mit mittlerer Auflösung",
        "ru": "jsonConfig оптимизация для планшетов и экранов среднего разрешения",
        "pt": "otimização jsonConfig para tablets e telas de resolução média",
        "nl": "jsonConfig optimalisatie voor tablets en medium resolutieschermen",
        "fr": "optimisation jsonConfig pour tablettes et écrans à résolution moyenne",
        "it": "ottimizzazione jsonConfig per tablet e schermi a media risoluzione",
        "es": "jsonConfig optimization for tablets and medium resolution screens",
        "pl": "optymalizacja jsonConfig dla tabletów i ekranów średniej rozdzielczości",
        "uk": "jsonConfig оптимізація для планшетів та екранів середнього дозволу",
        "zh-cn": "json 平板电脑和中分辨率屏幕的优化"
      },
      "4.0.0": {
        "en": "support different ems-esp bus id's for own states polled\nnow with jsonConfig for adapter config\nrework enum attributes for room and function for all adapter states created \nadmin adapter version >= 6.13.16 required - nicer layout with admin version >= 6.17.13",
        "de": "unterstützung verschiedener ems-esp-bus-ids für eigene staaten abgefragt\njetzt mit jsonConfig für Adapter config\nrework enum attribute für raum und funktion für alle erstellten adapterzustände\nadmin adapter version >= 6.13.16 erforderlich - schöneres layout mit admin-version >= 6.17.13",
        "ru": "поддержка различных ems-esp bus id для собственных штатов\nтеперь с jsonConfig для настройки адаптера\nдля всех созданных адаптеров\nадмин адаптер версия >= 6.13.16 требуется - более приятный макет с admin-версией >= 6.17.13",
        "pt": "suporte diferentes ems-esp bus id para os próprios estados pesquisados\nagora com jsonConfig para configuração do adaptador\nrework enum atributos para sala e função para todos os estados do adaptador criados\nadaptador de administração versão >= 6.13.16 necessário - layout mais agradável com versão admin >= 6.17.13",
        "nl": "ondersteuning van verschillende ems-esp bus id's voor eigen ondervraagde staten\nnu met jsonConfig voor adapterconfiguratie\nrework enum attributen voor ruimte en functie voor alle adapter toestanden aangemaakt\nadmin-adapterversie >= 6.13.16 vereist - mooiere lay-out met admin versie 6,17.13",
        "fr": "soutenir différents id bus ems-esp pour les états sondés\nmaintenant avec jsonConfig pour configuration d'adaptateur\nretravailler les attributs enum pour la pièce et la fonction pour tous les états d'adaptateur créés\nversion de l'adaptateur d'administration >= 6.13.16 requis - meilleure mise en page avec version admin >= 6.17.13",
        "it": "sostegno diverso ems-esp bus id per i propri stati inquinati\nora con jsonConfig per adattatore config\nrielaborare gli attributi enum per la stanza e la funzione per tutti gli stati dell'adattatore creati\nadattatore di amministrazione versione >= 6.13.16 richiesto - layout più bello con la versione di admin >= 6.17.13",
        "es": "soporte diferente ems-esp bus id para estados encuestados\nahora con jsonConfig para configuración de adaptador\nrework enum atributos para espacio y función para todos los estados adaptadores creados\nadecuador de administración de la versión 6.13.16 requerida - diseño más agradable con la versión de administración 6.17.13",
        "pl": "wsparcie różnych ems- esp magistrali id dla własnych stanów sondaży\nteraz z jsonConfig dla konfiguracji adaptera\nprzerabianie atrybutów enum dla pokoju i funkcji dla wszystkich utworzonych stanów adaptera\nwersja adaptera admin > = 6.13.16 wymagane - ładniejszy układ z wersją admin > = 6. 17. 13",
        "uk": "підтримка різних емс-еспа автобуса id для власних держав\nтепер з jsonConfig для налаштування адаптера\nпереробити атрибути енму для кімнати та функції для всіх станів адаптера\nверсія адаптера адміністратора >= 6.13.16 потрібних - фантастичний макет з версією адміністратора >= 6.17.13",
        "zh-cn": "支持不同的ems -esp bus id 为自己的州调查\n现在使用 jsonConfig 配置适配器\n为所有适配器状态创建房间和功能的重新工作enum属性\n管理适配器版本qq 6.13.16 需要 - 更好的版式,并配有管理版本qq 6.17.13 联合国"
      },
      "3.5.0": {
        "en": "warm water starts not supported anymore within statistics due to namechanges within ems-esp firmware 3.7",
        "de": "warmes wasser beginnt nicht mehr innerhalb von statistiken aufgrund von namensänderungen in ems-esp firmware 3.7 unterstützt",
        "ru": "теплая вода больше не поддерживается в статистике из-за изменений названия в ems-esp прошивки 3.7",
        "pt": "água quente começa não suportado mais dentro de estatísticas devido a alterações de nome dentro ems-esp firmware 3.7",
        "nl": "warm water begint niet meer ondersteund binnen statistieken als gevolg van naamwijzigingen binnen ems-esp firmware 3.7",
        "fr": "eau chaude ne commence plus pris en charge dans les statistiques en raison des changements de nom au sein du firmware ems-esp 3.7",
        "it": "acqua calda non inizia più supportato all'interno delle statistiche a causa dei cambi di nome all'interno del firmware ems-esp 3.7",
        "es": "agua tibia comienza ya no soportada dentro de las estadísticas debido a cambios de nombre dentro de ems-esp firmware 3.7",
        "pl": "ciepła woda zaczyna nie wspierane już w statystykach ze względu na nazwy w ems- esp firmware 3.7",
        "uk": "тепла вода не підтримується в будь-який час в статистиці завдяки обміну повідомленнями в е-esp прошивці 3.7",
        "zh-cn": "由于ems-esp固件3.7中的名称变化,在统计中不再支持暖水"
      }
    },
    "titleLang": {
      "en": "EMS-ESP (ems-esp & km200)",
      "de": "EMS-ESP (ems-esp & km200)",
      "ru": "EMS-ESP (ems-esp и km200)",
      "pt": "EMS-ESP (ems-esp & km200)",
      "nl": "EMS-ESP (ems-esp & km200)",
      "fr": "EMS-ESP (EMS-ESP & km200)",
      "it": "EMS-ESP (ems-esp e km200)",
      "es": "EMS-ESP (ems-esp y km200)",
      "pl": "EMS-ESP (ems-esp i km200)",
      "uk": "EMS-ESP (ems-esp & км200)",
      "zh-cn": "EMS-ESP (ems-esp & km200)"
    },
    "desc": {
      "en": "EMS (Energy Management System) based equipment from manufacturers like Bosch, Buderus, Nefit, Junkers, Worcester and Sieger.",
      "de": "EMS (Energy Management System) basierte Geräte von Herstellern wie Bosch, Buderus, Nefit, Junkers, Worcester und Sieger.",
      "ru": "Оборудование на базе EMS (системы управления энергопотреблением) от таких производителей, как Bosch, Buderus, Nefit, Junkers, Worcester и Sieger.",
      "pt": "Equipamentos baseados em EMS (Sistema de Gerenciamento de Energia) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "nl": "Op EMS (Energy Management System) gebaseerde apparatuur van fabrikanten als Bosch, Buderus, Nefit, Junkers, Worcester en Sieger.",
      "fr": "Équipements basés sur EMS (Energy Management System) de fabricants tels que Bosch, Buderus, Nefit, Junkers, Worcester et Sieger.",
      "it": "Apparecchiature basate su EMS (Energy Management System) di produttori come Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "es": "Equipos basados en EMS (Energy Management System) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester y Sieger.",
      "pl": "Sprzęt oparty na EMS (Energy Management System) takich producentów jak Bosch, Buderus, Nefit, Junkers, Worcester i Sieger.",
      "uk": "EMS (Система енергоменеджменту) на основі обладнання від виробників, таких як Bosch, Buderus, Nefit, Junkers, Worcester та Sieger.",
      "zh-cn": "来自 Bosch、Buderus、Nefit、Junkers、Worcester 和 Sieger 等制造商的基于 EMS（能源管理系统）的设备。"
    },
    "authors": [
      "Thomas Petrick <tp1degit@gmail.com>"
    ],
    "keywords": [
      "ems-esp",
      "Buderus",
      "Bosch",
      "Junkers",
      "Netfit",
      "Sieger",
      "Worcester",
      "km200",
      "central heating",
      "smarthome"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "stopBeforeUpdate": true,
    "platform": "Javascript/Node.js",
    "tier": 2,
    "icon": "ems-esp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/tp1de/ioBroker.ems-esp/main/admin/ems-esp.png",
    "readme": "https://github.com/tp1de/ioBroker.ems-esp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "stopTimeout": 1000,
    "dataFolder": "ems-esp.%INSTANCE%",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=4.0.24"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.13.16"
      }
    ],
    "encryptedNative": [
      "private_pw"
    ],
    "protectedNative": [
      "private_pw"
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<4.1.2",
            "newVersion>=4.0.2"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "This update contains a breaking change. Please stop instance before installing and check parameters afterwards.",
          "de": "Dieses Update enthält ein Breaking Change. Bitte stoppen Sie die Instanz vor der Installation und überprüfen Sie die Parameter danach.",
          "ru": "Это обновление содержит нарушающие изменения. Пожалуйста, остановите экземпляр перед установкой и проверьте параметры после.",
          "pt": "Esta atualização contém uma mudança de ruptura. Por favor, pare a instância antes de instalar e verificar os parâmetros depois.",
          "nl": "Deze update bevat een breuk verandering. Stop instance voor het installeren en controleer parameters achteraf.",
          "fr": "Cette mise à jour contient un changement de rupture. Veuillez arrêter l'instance avant d'installer et vérifier les paramètres après.",
          "it": "Questo aggiornamento contiene un cambiamento di rottura. Si prega di interrompere l'istanza prima di installare e controllare i parametri in seguito.",
          "es": "Esta actualización contiene un cambio de ruptura. Por favor deje de ejemplo antes de instalar y comprobar los parámetros después.",
          "pl": "Ta aktualizacja zawiera przełomową zmianę. Proszę zatrzymać instancję przed instalacją i sprawdzić parametry później.",
          "uk": "Цей оновлення містить зміни розриву. Будь ласка, припиніть екземпляр перед установкою і перевірте параметри після.",
          "zh-cn": "此更新包含一个突破性的更改 。 在安装之前请停止实例, 并在之后检查参数 ."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "private_pw": "",
    "control_file": "*",
    "km200_active": false,
    "km200_ip": "http://192.168.178.x",
    "km200_polling": 300,
    "km200_entry": "",
    "gateway_pw": "",
    "emsesp_active": true,
    "emsesp_ip": "http://ems-esp",
    "ems_apiv3": true,
    "ems_http_wait": 100,
    "ems_poll_wait": 500,
    "ems_token": "",
    "ems_polling": 60,
    "ems_dallas": false,
    "ems_dallas_old_format": false,
    "ems_analog": false,
    "ems_custom": false,
    "ems_custom_elements": false,
    "ems_energy": false,
    "ems_nominalpower": 15,
    "ems_modulation": "boiler.curburnpow",
    "ems_wwactive": "boiler.wwcharging",
    "recordings": false,
    "recordings_format": 0,
    "r_multi": 1,
    "r_month": true,
    "r_c": true,
    "statistics": false,
    "db": "",
    "db_instance": 0,
    "database": "iobroker",
    "km200_structure": false,
    "eff_active": false,
    "eff20": 109.4,
    "eff25": 109.3,
    "eff30": 108.3,
    "eff35": 108,
    "eff40": 106.5,
    "eff45": 105.2,
    "eff50": 103,
    "eff55": 100,
    "eff60": 98,
    "eff70": 97,
    "syslog": false,
    "syslog_port": 20516,
    "states_reorg": false,
    "heatdemand": false,
    "modulation": "",
    "supplytemp": "",
    "returntemp": "",
    "room": "boiler_room",
    "function": "heating",
    "devices": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": {
          "en": "File storage",
          "de": "Dateispeicher",
          "ru": "Хранение файлов",
          "pt": "Armazenamento de arquivos",
          "nl": "Veldopslag",
          "fr": "Stockage de fichiers",
          "it": "Archiviazione file",
          "es": "Almacenamiento de archivos",
          "pl": "Storage room",
          "uk": "Зберігання файлів",
          "zh-cn": "储存"
        },
        "type": "meta.user"
      },
      "native": {}
    }
  ]
}
