{
  "common": {
    "name": "ems-esp",
    "version": "4.0.1",
    "news": {
      "4.0.1": {
        "en": "jsonConfig optimization for tablets and medium resolution screens",
        "de": "jsonConfig-Optimierung für Tablets und Bildschirme mit mittlerer Auflösung",
        "ru": "jsonConfig оптимизация для планшетов и экранов среднего разрешения",
        "pt": "otimização jsonConfig para tablets e telas de resolução média",
        "nl": "jsonConfig optimalisatie voor tablets en medium resolutieschermen",
        "fr": "optimisation jsonConfig pour tablettes et écrans à résolution moyenne",
        "it": "ottimizzazione jsonConfig per tablet e schermi a media risoluzione",
        "es": "jsonConfig optimization for tablets and medium resolution screens",
        "pl": "optymalizacja jsonConfig dla tabletów i ekranów średniej rozdzielczości",
        "uk": "jsonConfig оптимізація для планшетів та екранів середнього дозволу",
        "zh-cn": "json 平板电脑和中分辨率屏幕的优化"
      },
      "4.0.0": {
        "en": "support different ems-esp bus id's for own states polled\nnow with jsonConfig for adapter config\nrework enum attributes for room and function for all adapter states created \nadmin adapter version >= 6.13.16 required - nicer layout with admin version >= 6.17.13",
        "de": "unterstützung verschiedener ems-esp-bus-ids für eigene staaten abgefragt\njetzt mit jsonConfig für Adapter config\nrework enum attribute für raum und funktion für alle erstellten adapterzustände\nadmin adapter version >= 6.13.16 erforderlich - schöneres layout mit admin-version >= 6.17.13",
        "ru": "поддержка различных ems-esp bus id для собственных штатов\nтеперь с jsonConfig для настройки адаптера\nдля всех созданных адаптеров\nадмин адаптер версия >= 6.13.16 требуется - более приятный макет с admin-версией >= 6.17.13",
        "pt": "suporte diferentes ems-esp bus id para os próprios estados pesquisados\nagora com jsonConfig para configuração do adaptador\nrework enum atributos para sala e função para todos os estados do adaptador criados\nadaptador de administração versão >= 6.13.16 necessário - layout mais agradável com versão admin >= 6.17.13",
        "nl": "ondersteuning van verschillende ems-esp bus id's voor eigen ondervraagde staten\nnu met jsonConfig voor adapterconfiguratie\nrework enum attributen voor ruimte en functie voor alle adapter toestanden aangemaakt\nadmin-adapterversie >= 6.13.16 vereist - mooiere lay-out met admin versie 6,17.13",
        "fr": "soutenir différents id bus ems-esp pour les états sondés\nmaintenant avec jsonConfig pour configuration d'adaptateur\nretravailler les attributs enum pour la pièce et la fonction pour tous les états d'adaptateur créés\nversion de l'adaptateur d'administration >= 6.13.16 requis - meilleure mise en page avec version admin >= 6.17.13",
        "it": "sostegno diverso ems-esp bus id per i propri stati inquinati\nora con jsonConfig per adattatore config\nrielaborare gli attributi enum per la stanza e la funzione per tutti gli stati dell'adattatore creati\nadattatore di amministrazione versione >= 6.13.16 richiesto - layout più bello con la versione di admin >= 6.17.13",
        "es": "soporte diferente ems-esp bus id para estados encuestados\nahora con jsonConfig para configuración de adaptador\nrework enum atributos para espacio y función para todos los estados adaptadores creados\nadecuador de administración de la versión 6.13.16 requerida - diseño más agradable con la versión de administración 6.17.13",
        "pl": "wsparcie różnych ems- esp magistrali id dla własnych stanów sondaży\nteraz z jsonConfig dla konfiguracji adaptera\nprzerabianie atrybutów enum dla pokoju i funkcji dla wszystkich utworzonych stanów adaptera\nwersja adaptera admin > = 6.13.16 wymagane - ładniejszy układ z wersją admin > = 6. 17. 13",
        "uk": "підтримка різних емс-еспа автобуса id для власних держав\nтепер з jsonConfig для налаштування адаптера\nпереробити атрибути енму для кімнати та функції для всіх станів адаптера\nверсія адаптера адміністратора >= 6.13.16 потрібних - фантастичний макет з версією адміністратора >= 6.17.13",
        "zh-cn": "支持不同的ems -esp bus id 为自己的州调查\n现在使用 jsonConfig 配置适配器\n为所有适配器状态创建房间和功能的重新工作enum属性\n管理适配器版本qq 6.13.16 需要 - 更好的版式,并配有管理版本qq 6.17.13 联合国"
      },
      "3.5.0": {
        "en": "warm water starts not supported anymore within statistics due to namechanges within ems-esp firmware 3.7",
        "de": "warmes wasser beginnt nicht mehr innerhalb von statistiken aufgrund von namensänderungen in ems-esp firmware 3.7 unterstützt",
        "ru": "теплая вода больше не поддерживается в статистике из-за изменений названия в ems-esp прошивки 3.7",
        "pt": "água quente começa não suportado mais dentro de estatísticas devido a alterações de nome dentro ems-esp firmware 3.7",
        "nl": "warm water begint niet meer ondersteund binnen statistieken als gevolg van naamwijzigingen binnen ems-esp firmware 3.7",
        "fr": "eau chaude ne commence plus pris en charge dans les statistiques en raison des changements de nom au sein du firmware ems-esp 3.7",
        "it": "acqua calda non inizia più supportato all'interno delle statistiche a causa dei cambi di nome all'interno del firmware ems-esp 3.7",
        "es": "agua tibia comienza ya no soportada dentro de las estadísticas debido a cambios de nombre dentro de ems-esp firmware 3.7",
        "pl": "ciepła woda zaczyna nie wspierane już w statystykach ze względu na nazwy w ems- esp firmware 3.7",
        "uk": "тепла вода не підтримується в будь-який час в статистиці завдяки обміну повідомленнями в е-esp прошивці 3.7",
        "zh-cn": "由于ems-esp固件3.7中的名称变化,在统计中不再支持暖水"
      },
      "3.4.4": {
        "en": "improve delays between axios get requests for km200 and ems-esp to avoid errors",
        "de": "verbesserung der verzögerungen zwischen axios erhalten anfragen für km200 und ems-esp, um fehler zu vermeiden",
        "ru": "улучшить задержки между axios получать запросы на км200 и ems-esp, чтобы избежать ошибок",
        "pt": "melhorar os atrasos entre axios obter pedidos de km200 e ems-esp para evitar erros",
        "nl": "verbeteren van vertragingen tussen axio's krijgen verzoeken voor km200 en ems-esp om fouten te voorkomen",
        "fr": "améliorer les délais entre axios obtenir des demandes pour km200 et ems-esp pour éviter les erreurs",
        "it": "migliorare i ritardi tra assio ottenere richieste per km200 e ems-esp per evitare errori",
        "es": "mejorar los retrasos entre axios obtener solicitudes de km200 y ems-esp para evitar errores",
        "pl": "poprawić opóźnienia między aksjonami uzyskać wnioski o km200 i ems- esp, aby uniknąć błędów",
        "uk": "поліпшення затримок між axios отримувати запити на км200 і емс-есп, щоб уникнути помилок",
        "zh-cn": "改善轴之间的延迟 获取 km200 和 ems- esp 的请求以避免错误"
      },
      "3.4.3": {
        "en": "corrections for reading gateway data for km200 gateway",
        "de": "korrekturen zum lesen von gateway-daten für km200 gateway",
        "ru": "исправления для чтения данных шлюза km200",
        "pt": "correções para ler dados de gateway para o gateway km200",
        "nl": "correcties voor het lezen van gatewaygegevens voor km200 gateway",
        "fr": "corrections pour la lecture des données de passerelle pour la passerelle km200",
        "it": "correzioni per la lettura dei dati del gateway per il gateway km200",
        "es": "correcciones para la lectura de los datos de la puerta de entrada de km200",
        "pl": "korekty dotyczące odczytu danych bramki dla bramki km200",
        "uk": "корекція для читання даних шлюзу на км200",
        "zh-cn": "km200网关读取网关数据的更正"
      },
      "3.4.2": {
        "en": "update dependencies\nreplace setTimeout by adapter.delay",
        "de": "aktualisierung der abhängigkeiten\nersetzen Set Timeout per Adapter. Verzögerung",
        "ru": "обновление зависимостей\nзаменить Время за адаптером. отсрочка",
        "pt": "dependências\nsubstituir o conjunto Timeout por adaptador. atraso",
        "nl": "afhankelijkheden bijwerken\nvervangen set Timeout door adapter. vertraging",
        "fr": "mettre à jour les dépendances\nremplacer l'ensemble Temps mort par adaptateur. retard",
        "it": "aggiornamento dipendenze\nset di sostituzione Timeout per adattatore. ritardo",
        "es": "dependencias de actualización\nreemplazado Timeout por adaptador. demora",
        "pl": "aktualizacji zależności\nzestaw zastępczy Przerwa przez adapter. opóźnienie",
        "uk": "оновлення залежності\nзамінний набір Розклад за допомогою адаптера. затримка",
        "zh-cn": "更新依赖关系\n替换集 适配器暂停. 延迟"
      },
      "3.4.1": {
        "en": "correct enum settings for ems-esp gateway on adapter start",
        "de": "korrekte enum-einstellungen für ems-esp-gateway auf adapterstart",
        "ru": "правильные настройки ems-esp для адаптера",
        "pt": "configurações enum corretas para gateway ems-esp no início do adaptador",
        "nl": "correcte enum instellingen voor ems-esp gateway op adapterstart",
        "fr": "corrects paramètres enum pour la passerelle ems-esp au démarrage de l'adaptateur",
        "it": "impostazioni enum corrette per il gateway ems-esp all'inizio dell'adattatore",
        "es": "ajustes de enum correctos para la entrada ems-esp en el arranque del adaptador",
        "pl": "prawidłowe ustawienia enum dla bramki ems- esp przy uruchomieniu adaptera",
        "uk": "виправлено налаштування емс-esp шлюзу на старті адаптера",
        "zh-cn": "适配器启动时 ems- esp 网关的正确enum 设置"
      }
    },
    "titleLang": {
      "en": "EMS-ESP (ems-esp & km200)",
      "de": "EMS-ESP (ems-esp & km200)",
      "ru": "EMS-ESP (ems-esp и km200)",
      "pt": "EMS-ESP (ems-esp & km200)",
      "nl": "EMS-ESP (ems-esp & km200)",
      "fr": "EMS-ESP (EMS-ESP & km200)",
      "it": "EMS-ESP (ems-esp e km200)",
      "es": "EMS-ESP (ems-esp y km200)",
      "pl": "EMS-ESP (ems-esp i km200)",
      "uk": "EMS-ESP (ems-esp & км200)",
      "zh-cn": "EMS-ESP (ems-esp & km200)"
    },
    "desc": {
      "en": "EMS (Energy Management System) based equipment from manufacturers like Bosch, Buderus, Nefit, Junkers, Worcester and Sieger.",
      "de": "EMS (Energy Management System) basierte Geräte von Herstellern wie Bosch, Buderus, Nefit, Junkers, Worcester und Sieger.",
      "ru": "Оборудование на базе EMS (системы управления энергопотреблением) от таких производителей, как Bosch, Buderus, Nefit, Junkers, Worcester и Sieger.",
      "pt": "Equipamentos baseados em EMS (Sistema de Gerenciamento de Energia) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "nl": "Op EMS (Energy Management System) gebaseerde apparatuur van fabrikanten als Bosch, Buderus, Nefit, Junkers, Worcester en Sieger.",
      "fr": "Équipements basés sur EMS (Energy Management System) de fabricants tels que Bosch, Buderus, Nefit, Junkers, Worcester et Sieger.",
      "it": "Apparecchiature basate su EMS (Energy Management System) di produttori come Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "es": "Equipos basados en EMS (Energy Management System) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester y Sieger.",
      "pl": "Sprzęt oparty na EMS (Energy Management System) takich producentów jak Bosch, Buderus, Nefit, Junkers, Worcester i Sieger.",
      "uk": "EMS (Система енергоменеджменту) на основі обладнання від виробників, таких як Bosch, Buderus, Nefit, Junkers, Worcester та Sieger.",
      "zh-cn": "来自 Bosch、Buderus、Nefit、Junkers、Worcester 和 Sieger 等制造商的基于 EMS（能源管理系统）的设备。"
    },
    "authors": [
      "Thomas Petrick <tp1degit@gmail.com>"
    ],
    "keywords": [
      "ems-esp",
      "Buderus",
      "Bosch",
      "Junkers",
      "Netfit",
      "Sieger",
      "Worcester",
      "km200",
      "central heating",
      "smarthome"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "tier": 2,
    "icon": "ems-esp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/tp1de/ioBroker.ems-esp/main/admin/ems-esp.png",
    "readme": "https://github.com/tp1de/ioBroker.ems-esp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "stopTimeout": 1000,
    "dataFolder": "ems-esp.%INSTANCE%",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=4.0.24"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.13.16"
      }
    ],
    "installedFrom": "tp1de/ioBroker.ems-esp"
  },
  "encryptedNative": [
    "private_pw"
  ],
  "protectedNative": [
    "private_pw"
  ],
  "messages": [
    {
      "condition": {
        "operand": "and",
        "rules": [
          "oldVersion<4.0.1",
          "newVersion>=4.0.1"
        ]
      },
      "title": {
        "en": "Important notice!",
        "de": "Wichtiger Hinweis!",
        "ru": "Важное замечание!",
        "pt": "Notícia importante!",
        "nl": "Belangrijke mededeling!",
        "fr": "Avis important!",
        "it": "Avviso IMPORTANTE!",
        "es": "Noticia importante!",
        "pl": "Ważna uwaga!",
        "zh-cn": "重要通知!",
        "uk": "Важливе повідомлення!"
      },
      "text": {
        "en": "This update contains a breaking change.",
        "de": "Dieses Update enthält eine kritische Änderung.",
        "ru": "Это обновление содержит нарушающие изменения.",
        "pt": "Esta atualização contém uma mudança de ruptura. ",
        "nl": "Deze update bevat een breuk verandering.",
        "fr": "Cette mise à jour contient un changement de rupture. ",
        "it": "Questo aggiornamento contiene un cambiamento di rottura.",
        "es": "Esta actualización contiene un cambio de ruptura. ",
        "pl": "Ta aktualizacja zawiera przełomową zmianę.",
        "uk": "Цей оновлення містить зміни розриву. ",
        "zh-cn": "此更新包含一个突破性的更改 "
      },
      "level": "warn",
      "buttons": [
        "agree",
        "cancel"
      ]
    }
  ],
  "native": {
    "password": "",
    "control_file": "*",
    "km200_active": false,
    "km200_ip": "http://192.168.178.x",
    "km200_polling": 300,
    "km200_entry": "",
    "gateway_pw": "",
    "emsesp_active": true,
    "emsesp_ip": "http://ems-esp",
    "ems_apiv3": true,
    "ems_http_wait": 100,
    "ems_poll_wait": 500,
    "ems_token": "",
    "ems_polling": 60,
    "ems_dallas": false,
    "ems_dallas_old_format": false,
    "ems_analog": false,
    "ems_custom": false,
    "ems_custom_elements": false,
    "ems_energy": false,
    "ems_nominalpower": 15,
    "ems_modulation": "boiler.curburnpow",
    "ems_wwactive": "boiler.wwcharging",
    "recordings": false,
    "recordings_format": 0,
    "r_multi": 1,
    "r_month": true,
    "r_c": true,
    "statistics": false,
    "db": "",
    "db_instance": 0,
    "database": "iobroker",
    "km200_structure": false,
    "eff_active": false,
    "eff20": 109.4,
    "eff25": 109.3,
    "eff30": 108.3,
    "eff35": 108,
    "eff40": 106.5,
    "eff45": 105.2,
    "eff50": 103,
    "eff55": 100,
    "eff60": 98,
    "eff70": 97,
    "syslog": false,
    "syslog_port": 20516,
    "states_reorg": false,
    "heatdemand": false,
    "modulation": "",
    "supplytemp": "",
    "returntemp": "",
    "room": "boiler_room",
    "function": "heating",
    "devices": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": {
          "en": "File storage",
          "de": "Dateispeicher",
          "ru": "Хранение файлов",
          "pt": "Armazenamento de arquivos",
          "nl": "Veldopslag",
          "fr": "Stockage de fichiers",
          "it": "Archiviazione file",
          "es": "Almacenamiento de archivos",
          "pl": "Storage room",
          "uk": "Зберігання файлів",
          "zh-cn": "储存"
        },
        "type": "meta.user"
      },
      "native": {}
    }
  ]
}
