{
  "common": {
    "name": "ems-esp",
    "version": "4.8.0",
    "news": {
      "4.8.0": {
        "en": "ems-esp: disabled parameter to search for extended EMS+ entities due to memory limitations in gateway",
        "de": "ems-esp: deaktivierter Parameter zur Suche nach erweiterten EMS+-Einheiten aufgrund von Speicherbeschränkungen im Gateway",
        "ru": "ems-esp: отключенный параметр для поиска расширенных EMS+ объектов из-за ограничений памяти в шлюзах",
        "pt": "ems-esp: parâmetro desativado para procurar entidades EMS+ estendidas devido às limitações de memória no gateway",
        "nl": "ems-esp: uitgeschakelde parameter om uitgebreide EMS+-entiteiten te zoeken vanwege geheugenbeperkingen in gateway",
        "fr": "ems-esp: paramètre désactivé pour rechercher des entités EMS+ étendues en raison des limitations de mémoire dans la passerelle",
        "it": "ems-esp: parametro disabilitato per la ricerca di entità EMS+ estese a causa delle limitazioni di memoria nel gateway",
        "es": "ems-esp: Parámetro deshabilitado para buscar entidades EMS+ extendidas debido a limitaciones de memoria en gateway",
        "pl": "ems- esp: nieaktywny parametr do wyszukiwania rozszerzonych jednostek EMS + z powodu ograniczeń pamięci w bramie",
        "uk": "ems-esp: параметр відключення для пошуку розширених суб'єктів EMS+ через обмеження пам'яті в шлюзу",
        "zh-cn": "ems- esp: 由于网关内存限制, 无法搜索扩展的EMS+ 实体的参数"
      },
      "4.7.2": {
        "en": "ems-esp: enable writing on custom entities",
        "de": "ems-esp: aktivieren sie das schreiben von benutzerdefinierten einheiten",
        "ru": "ems-esp: включить написание на пользовательских объектах",
        "pt": "ems-esp: permitir escrever em entidades personalizadas",
        "nl": "ems-esp: schrijven op aangepaste entiteiten inschakelen",
        "fr": "ems-esp: active l'écriture sur des entités personnalisées",
        "it": "ems-esp: abilitare la scrittura su entità personalizzate",
        "es": "ems-esp: habilitar la escritura en entidades personalizadas",
        "pl": "ems- esp: umożliwia zapis na niestandardowych podmiotach",
        "uk": "ems-esp: увімкніть написання на користувача",
        "zh-cn": "ems- ep: 启用自定义实体的写入"
      },
      "4.7.1": {
        "en": "ems-esp: custom entities are now under object structure \"custom\"",
        "de": "ems-esp: benutzerdefinierte wesen sind jetzt unter objektstruktur \"custom\"",
        "ru": "ems-esp: пользовательские сущности в настоящее время находятся под объектной структурой «custom»",
        "pt": "ems-esp: entidades personalizadas estão agora sob estrutura de objeto \"personalizado\"",
        "nl": "ems-esp: aangepaste entiteiten staan nu onder objectstructuur \"custom\"",
        "fr": "ems-esp: les entités personnalisées sont désormais sous la structure de l'objet \"custom\"",
        "it": "ems-esp: le entità personalizzate sono ora sotto la struttura dell'oggetto \"custom\"",
        "es": "ems-esp: las entidades personalizadas están ahora bajo la estructura de objetos \"personal\"",
        "pl": "ems- esp: podmioty niestandardowe są teraz pod strukturą obiektu \"niestandardowe\"",
        "uk": "ems-esp: суб'єкти господарювання тепер під структурою об'єкта \"кутом\"",
        "zh-cn": "ems- esp: 自定义实体现在处于对象结构“ custom” 下"
      },
      "4.7.0": {
        "en": "ems-esp: do not allow more then one thermostat for extended own entities\nems-esp: error correction for holidayModes custom entities",
        "de": "ems-esp: nicht zulassen mehr als ein thermostat für erweiterte eigene einrichtungen\nems-esp: Fehlerkorrektur für den Urlaub Moden benutzerdefinierte Einheiten",
        "ru": "ems-esp: не допускайте больше, чем один термостат для расширенных собственных объектов\nems-esp: коррекция ошибок для отпуска Режимы",
        "pt": "ems-esp: não permita mais um termostato para entidades próprias estendidas\nems-esp: correção de erro para férias Modos de entidades personalizadas",
        "nl": "ems-esp: niet meer dan één thermostaat toestaan voor uitgebreide eigen entiteiten\nems-esp: foutcorrectie voor vakantie Modi aangepaste entiteiten",
        "fr": "ems-esp: ne pas autoriser plus d'un thermostat pour les entités propres étendues\nems-esp: correction d'erreur pour les vacances Modes entités personnalisées",
        "it": "ems-esp: non consentono più di un termostato per entità proprie estese\nems-esp: correzione di errore per le vacanze Modalità entità personalizzate",
        "es": "ems-esp: no permita más entonces un termostato para entidades propias extendidas\nems-esp: corrección de error para vacaciones Modes custom entities",
        "pl": "ems- esp: nie pozwól więcej niż jeden termostat dla rozszerzonych jednostek własnych\nems- esp: korekta błędów podczas wakacji Tryby podmiotów niestandardowych",
        "uk": "ems-esp: не дозволяйте більше, ніж один термостат для розширених власних суб'єктів\nе-есп: виправлення помилок для свята Режими індивідуальних суб'єктів",
        "zh-cn": "ems- esp : 不允许扩展的自身实体使用一个以上的自动调温器\nems- esp: 节假日错误校正 模式自定义实体"
      },
      "4.6.4": {
        "en": "ems-esp: error correction on polling for 3.6.5",
        "de": "ems-esp: fehlerkorrektur bei der abstimmung für 3.6.5",
        "ru": "ems-esp: коррекция ошибок на выборах 3.6.5",
        "pt": "ems-esp: correção de erro na sondagem para 3.6.5",
        "nl": "ems-esp: foutcorrectie bij peiling voor 3.6.5",
        "fr": "ems-esp: correction d'erreur lors du vote pour 3.6.5",
        "it": "ems-esp: correzione di errore sul polling per 3.6.5",
        "es": "ems-esp: corrección de error en la encuesta por 3.6.5",
        "pl": "ems- esp: korekta błędów podczas sondażu dla 3.6.5",
        "uk": "ems-esp: корекція помилок на опитуванні за 3.6.5",
        "zh-cn": "ems-esp:3.6.5选票错误更正"
      },
      "4.6.3": {
        "en": "small adjustments\ndependabot updates dependencies",
        "de": "kleine anpassungen\nabhängigabot aktualisiert abhängigkeiten",
        "ru": "небольшие корректировки\nзависимости обновлений",
        "pt": "pequenos ajustes\ndependências de atualizações de dependabot",
        "nl": "kleine aanpassingen\ndependabot updates afhankelijkheden",
        "fr": "petits ajustements\ndépendances des mises à jour de dependabot",
        "it": "piccoli aggiustamenti\naggiornamenti dipendenze",
        "es": "pequeños ajustes\ndependencias de actualizaciones",
        "pl": "niewielkie dostosowania\nzależności od aktualizacji zależnościname",
        "uk": "невеликі настройки\nзалежностей",
        "zh-cn": "小调整\n依赖性更新"
      },
      "4.6.2": {
        "en": "ems-esp: re-introduce restart of ems init/polling after firmware version change and 90 seconds waiting time",
        "de": "ems-esp: neustart von ems init/polling nach firmware-versionsänderung und 90 sekunden wartezeit",
        "ru": "ems-esp: повторно ввести перезапуск ems init/polling после изменения версии прошивки и 90 секунд ожидания",
        "pt": "ems-esp: re-introduce restart de ems init/polling após a mudança da versão do firmware e 90 segundos tempo de espera",
        "nl": "ems-esp: herstart van ems init/polling na wijziging van firmwareversie en 90 seconden wachttijd",
        "fr": "ems-esp: réintroduire le redémarrage de ems init/polling après le changement de version du firmware et 90 secondes de temps d'attente",
        "it": "ems-esp: re-introdurre il riavvio di ems init/polling dopo il cambiamento della versione del firmware e 90 secondi tempo di attesa",
        "es": "ems-esp: re-introduce restart of ems init/polling after firmware version change and 90 segundos waiting time",
        "pl": "ems- esp: ponownie wprowadzić restart ems init / polling po zmianie wersji firmware i 90 sekund oczekiwania",
        "uk": "ems-esp: re-introduce перезавантаження емів init/polling після зміни версії прошивки і 90 секунд очікування час",
        "zh-cn": "ems-esp:在固件版本更改和90秒等待时间后,重新激活ems init/poling"
      }
    },
    "titleLang": {
      "en": "EMS-ESP (ems-esp & km200)",
      "de": "EMS-ESP (ems-esp & km200)",
      "ru": "EMS-ESP (ems-esp и km200)",
      "pt": "EMS-ESP (ems-esp & km200)",
      "nl": "EMS-ESP (ems-esp & km200)",
      "fr": "EMS-ESP (EMS-ESP & km200)",
      "it": "EMS-ESP (ems-esp e km200)",
      "es": "EMS-ESP (ems-esp y km200)",
      "pl": "EMS-ESP (ems-esp i km200)",
      "uk": "EMS-ESP (ems-esp & км200)",
      "zh-cn": "EMS-ESP (ems-esp & km200)"
    },
    "desc": {
      "en": "EMS (Energy Management System) based equipment from manufacturers like Bosch, Buderus, Nefit, Junkers, Worcester and Sieger.",
      "de": "EMS (Energy Management System) basierte Geräte von Herstellern wie Bosch, Buderus, Nefit, Junkers, Worcester und Sieger.",
      "ru": "Оборудование на базе EMS (системы управления энергопотреблением) от таких производителей, как Bosch, Buderus, Nefit, Junkers, Worcester и Sieger.",
      "pt": "Equipamentos baseados em EMS (Sistema de Gerenciamento de Energia) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "nl": "Op EMS (Energy Management System) gebaseerde apparatuur van fabrikanten als Bosch, Buderus, Nefit, Junkers, Worcester en Sieger.",
      "fr": "Équipements basés sur EMS (Energy Management System) de fabricants tels que Bosch, Buderus, Nefit, Junkers, Worcester et Sieger.",
      "it": "Apparecchiature basate su EMS (Energy Management System) di produttori come Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "es": "Equipos basados en EMS (Energy Management System) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester y Sieger.",
      "pl": "Sprzęt oparty na EMS (Energy Management System) takich producentów jak Bosch, Buderus, Nefit, Junkers, Worcester i Sieger.",
      "uk": "EMS (Система енергоменеджменту) на основі обладнання від виробників, таких як Bosch, Buderus, Nefit, Junkers, Worcester та Sieger.",
      "zh-cn": "来自 Bosch、Buderus、Nefit、Junkers、Worcester 和 Sieger 等制造商的基于 EMS（能源管理系统）的设备。"
    },
    "authors": [
      "Thomas Petrick <tp1degit@gmail.com>"
    ],
    "keywords": [
      "ems-esp",
      "Buderus",
      "Bosch",
      "Junkers",
      "Netfit",
      "Sieger",
      "Worcester",
      "km200",
      "central heating",
      "smarthome"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "stopBeforeUpdate": true,
    "platform": "Javascript/Node.js",
    "tier": 2,
    "icon": "ems-esp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/tp1de/ioBroker.ems-esp/main/admin/ems-esp.png",
    "readme": "https://github.com/tp1de/ioBroker.ems-esp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "stopTimeout": 1000,
    "dataFolder": "ems-esp.%INSTANCE%",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.13.16"
      }
    ],
    "encryptedNative": [
      "private_pw"
    ],
    "protectedNative": [
      "private_pw"
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<4.1.2",
            "newVersion>=4.0.2"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "This update contains a breaking change. Please stop instance before installing and check parameters afterwards.",
          "de": "Dieses Update enthält ein Breaking Change. Bitte stoppen Sie die Instanz vor der Installation und überprüfen Sie die Parameter danach.",
          "ru": "Это обновление содержит нарушающие изменения. Пожалуйста, остановите экземпляр перед установкой и проверьте параметры после.",
          "pt": "Esta atualização contém uma mudança de ruptura. Por favor, pare a instância antes de instalar e verificar os parâmetros depois.",
          "nl": "Deze update bevat een breuk verandering. Stop instance voor het installeren en controleer parameters achteraf.",
          "fr": "Cette mise à jour contient un changement de rupture. Veuillez arrêter l'instance avant d'installer et vérifier les paramètres après.",
          "it": "Questo aggiornamento contiene un cambiamento di rottura. Si prega di interrompere l'istanza prima di installare e controllare i parametri in seguito.",
          "es": "Esta actualización contiene un cambio de ruptura. Por favor deje de ejemplo antes de instalar y comprobar los parámetros después.",
          "pl": "Ta aktualizacja zawiera przełomową zmianę. Proszę zatrzymać instancję przed instalacją i sprawdzić parametry później.",
          "uk": "Цей оновлення містить зміни розриву. Будь ласка, припиніть екземпляр перед установкою і перевірте параметри після.",
          "zh-cn": "此更新包含一个突破性的更改 。 在安装之前请停止实例, 并在之后检查参数 ."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ],
    "installedFrom": "iobroker.ems-esp@4.8.0"
  },
  "native": {
    "private_pw": "",
    "control_file": "*",
    "km200_active": false,
    "km200_ip": "http://192.168.178.x",
    "km200_polling": 300,
    "km200_entry": "",
    "gateway_pw": "",
    "emsesp_active": true,
    "emsesp_ip": "http://ems-esp",
    "ems_apiv3": true,
    "ems_http_wait": 100,
    "ems_poll_wait": 500,
    "ems_token": "",
    "ems_polling": 60,
    "ems_dallas": false,
    "ems_dallas_old_format": false,
    "ems_analog": false,
    "ems_custom": false,
    "ems_custom_elements": false,
    "ems_energy": false,
    "ems_nominalpower": 15,
    "ems_modulation": "boiler.curburnpow",
    "ems_wwactive": "boiler.wwcharging",
    "recordings": false,
    "recordings_format": 0,
    "r_multi": 1,
    "r_month": true,
    "r_c": true,
    "statistics": false,
    "db": "",
    "db_instance": 0,
    "database": "iobroker",
    "km200_structure": false,
    "eff_active": false,
    "eff20": 109.4,
    "eff25": 109.3,
    "eff30": 108.3,
    "eff35": 108,
    "eff40": 106.5,
    "eff45": 105.2,
    "eff50": 103,
    "eff55": 100,
    "eff60": 98,
    "eff70": 97,
    "syslog": false,
    "syslog_port": 20516,
    "states_reorg": false,
    "heatdemand": false,
    "modulation": "",
    "supplytemp": "",
    "returntemp": "",
    "room": "boiler_room",
    "function": "heating",
    "devices": []
  },
  "objects": []
}
