{
  "common": {
    "name": "ems-esp",
    "version": "4.4.2",
    "news": {
      "4.4.2": {
        "en": "ems-esp: update in respect to changes in JSON structure without spaces in System Info\nems-esp: delete the esp object-structure on start of the adapter instance. It will be rebuild.",
        "de": "ems-esp: Aktualisierung in Bezug auf Änderungen der JSON-Struktur ohne Leerzeichen in Systeminfo\nems-esp: Löschen Sie die esp-Objektstruktur beim Start der Adapterinstanz. Es wird wieder aufgebaut.",
        "ru": "ems-esp: обновление в отношении изменений в структуре JSON без пробелов в System Info\nems-esp: Удалить объектно-структуру esp в начале экземпляра адаптера. Он будет восстановлен.",
        "pt": "ems-esp: atualização em relação às mudanças na estrutura JSON sem espaços em System Info\nems-esp: exclua a estrutura do objeto esp no início da instância do adaptador. Vai ser uma reconstrução.",
        "nl": "ems-esp: update met betrekking tot wijzigingen in JSON structuur zonder spaties in System Info\nems-esp: verwijder de esp objectstructuur bij het begin van de adapter instantie. Het zal worden herbouwd.",
        "fr": "ems-esp: mise à jour des modifications de la structure JSON sans espaces dans System Info\nems-esp: supprimer la structure objet esp au début de l'instance adaptateur. Il sera reconstruit.",
        "it": "ems-esp: aggiornamento rispetto alle modifiche della struttura JSON senza spazi in System Info\nems-esp: eliminare la struttura dell'oggetto esp all'inizio dell'istanza dell'adattatore. Sarà ricostruita.",
        "es": "ems-esp: actualización respecto a los cambios en la estructura JSON sin espacios en System Info\nems-esp: eliminar la estructura del objeto esp en el inicio de la instancia del adaptador. Será reconstruido.",
        "pl": "ems- esp: aktualizacja w odniesieniu do zmian w strukturze JSON bez spacji w Systemie Info\nems- esp: usuń strukturę obiektu esp na początku instancji adaptera. To będzie odbudowa.",
        "uk": "ems-esp: оновлення щодо змін структури JSON без пробілів в System Info\nems-esp: видалення об'єкта-структури запобіжника на старті екземпляра адаптера. Це буде перебудувати.",
        "zh-cn": "ems- ep: 关于系统信息中没有空格的 JSON 结构变化的更新\nems-esp:在适配器实例启动时删除 esp 对象结构 。 它将重建."
      },
      "4.4.1": {
        "en": "avoid crashes when undefined states are changed (old state names in vis)",
        "de": "vermeiden sie abstürzen, wenn undefinierte zustände geändert werden (alte staatsnamen in vis)",
        "ru": "избегать крушений при изменении неопределенных состояний (старые названия состояний в vis)",
        "pt": "evitar falhas quando os estados não definidos são alterados (nomes de estado antigo em vis)",
        "nl": "crashes vermijden wanneer ongedefinieerde toestanden worden gewijzigd (oude staatnamen in vis)",
        "fr": "éviter les crashs lorsque des états non définis sont changés (anciens noms d'état en vis)",
        "it": "evitare crash quando gli stati non definiti vengono modificati (vecchi nomi di stato in vis)",
        "es": "evitar fallos cuando los estados no definidos son cambiados (nombres antiguos en vis)",
        "pl": "uniknąć awarii po zmianie niezdefiniowanych stanów (stare nazwy stanu w vis)",
        "uk": "уникати аварійних ситуацій при зміні не визначених станів (старих державних імен у в’язках)",
        "zh-cn": "避免在未定义状态更改时发生崩溃( 旧状态名称对应)"
      },
      "4.4.0": {
        "en": "update dependencies\ntest that necessary entities for statistics function are available\nkm200: ignore values during polling when value is not within min/max range\nkm200: ignore axios read errors on recordings (no error message)\navoid crashes when undefined states are changed (old state names in vis)\nems-esp: restart adapter instance on change of firmware version",
        "de": "aktualisierung der abhängigkeiten\nprüfen sie, dass notwendige einheiten für die statistikfunktion verfügbar sind\nkm200: ignorieren sie werte während der umfrage, wenn der wert nicht innerhalb von min/max bereich liegt\nkm200: ignorieren axios lesefehler auf aufnahmen (keine fehlermeldung)\nvermeiden sie abstürzen, wenn undefinierte zustände geändert werden (alte staatsnamen in vis)\nems-esp: neustart-adapter-instanz beim wechsel der firmware-version",
        "ru": "обновление зависимостей\nпроверить, имеются ли необходимые подразделения для выполнения функции статистики\nkm200: игнорировать значения во время голосования, когда значение не находится в пределах диапазона мин/макс\nkm200: проигнорировать ошибки чтения аксиоса на записи (без сообщения об ошибке)\nизбегать крушений при изменении неопределенных состояний (старые названия состояний в vis)\nems-esp: пример перезапуска адаптера при смене версии прошивки",
        "pt": "dependências\nteste que as entidades necessárias para a função estatística estão disponíveis\nkm200: ignorar valores durante a sondagem quando o valor não está dentro da faixa min/max\nkm200: ignorar axios ler erros nas gravações (sem mensagem de erro)\nevitar falhas quando os estados não definidos são alterados (nomes de estado antigo em vis)\nems-esp: instância do adaptador de reinício na mudança da versão do firmware",
        "nl": "afhankelijkheden bijwerken\ntest of de voor de statistiekfunctie noodzakelijke entiteiten beschikbaar zijn\nkm200: negeer waarden tijdens de peiling wanneer de waarde niet binnen min/max bereik ligt\nkm200: negeer axio's leesfouten bij opnames (geen foutmelding)\ncrashes vermijden wanneer ongedefinieerde toestanden worden gewijzigd (oude staatnamen in vis)\nems-esp: herstart adapter instance bij verandering van firmware versie",
        "fr": "mettre à jour les dépendances\ntest que les entités nécessaires pour la fonction statistique sont disponibles\nkm200: ignorer les valeurs pendant le scrutin lorsque la valeur n'est pas dans la plage min/max\nkm200: ignorez les erreurs de lecture des axios sur les enregistrements (pas de message d'erreur)\néviter les crashs lorsque des états non définis sont changés (anciens noms d'état en vis)\nems-esp: redémarrer l'instance de l'adaptateur sur le changement de version du firmware",
        "it": "aggiornamento dipendenze\nprova che le entità necessarie per la funzione statistica sono disponibili\nkm200: ignorare i valori durante l'inquinamento quando il valore non è all'interno della gamma min/max\nkm200: ignorare gli errori di lettura di assios sulle registrazioni (senza messaggio di errore)\nevitare crash quando gli stati non definiti vengono modificati (vecchi nomi di stato in vis)\nems-esp: riavviare l'istanza dell'adattatore sul cambiamento della versione del firmware",
        "es": "dependencias de actualización\nprueba de que las entidades necesarias para la función estadística están disponibles\nkm200: ignorar los valores durante la votación cuando el valor no está dentro del rango min/max\nkm200: ignore axios leer errores en las grabaciones (sin mensaje de error)\nevitar fallos cuando los estados no definidos son cambiados (nombres antiguos en vis)\nems-esp: instancia de adaptador de reinicio sobre cambio de la versión de firmware",
        "pl": "aktualizacji zależności\nsprawdzić, czy dostępne są niezbędne podmioty do pełnienia funkcji statystyki\nkm200: ignorować wartości podczas głosowania, gdy wartość nie mieści się w zakresie min / max\nkm200: ignoruj błędy odczytu axios na nagraniach (brak komunikatu błędu)\nuniknąć awarii po zmianie niezdefiniowanych stanów (stare nazwy stanu w vis)\nems- esp: restart instancji adaptera przy zmianie wersji oprogramowania firmowego",
        "uk": "оновлення залежності\nтестування, які необхідні суб'єкти для статистичної функції доступні\nкм200: ігнорувати значення під час опитування при значенні не в діапазоні мін/макс\nkm200: ігнорувати axios читати помилки на записах (не повідомлення про помилку)\nуникати аварійних ситуацій при зміні не визначених станів (старих державних імен у в’язках)\nems-esp: перезавантаження екземпляра на зміну версії прошивки",
        "zh-cn": "更新依赖关系\n测试是否存在统计功能所需的实体\nkm200: 当数值不在分钟/最大范围内时, 投票时忽略数值\nkm200: 忽略在录音中读取错误( 无错误消息)\n避免在未定义状态更改时发生崩溃( 旧状态名称对应)\nems- ep: 在更改固件版本时重新启动适配器实例"
      },
      "4.3.0": {
        "en": "improve search for EMS+ and EMS 2.0 entities (switchTimes & holidayModes) with raw telegrams\nsupport different thermostat id's\nchange ems-esp warning messages to info on start-up for 3.7 dev versions",
        "de": "verbesserung der Suche nach EMS+ und EMS 2.0-Entitäten (SwitchTimes & HolidayModes) mit Rohtelegrammen\nverschiedene thermostat-ids unterstützen\nems-esp-warnmeldungen zum start-up für 3.7 dev-versionen ändern",
        "ru": "улучшить поиск EMS+ и EMS 2.0 сущностей (switchTimes & HolidayModes) с необработанными телеграммами\nподдержка различных термостат id\nизменение ems-esp предупреждающих сообщений на информацию о запуске для 3,7 версии dev",
        "pt": "melhorar a procura de EMS+ e EMS 2.0 entidades (switchTimes & holidayModes) com telegramas crus\nsuporte diferentes termostato id's\nalterar mensagens de aviso ems-esp para informações sobre start-up para versões 3.7 dev",
        "nl": "verbetering van het zoeken naar EMS+ en EMS 2.0 entiteiten (switchTimes & holidayModes) met ruwe telegrammen\nondersteuning voor verschillende thermostaat id's\nems-esp-waarschuwingsberichten wijzigen in informatie over het opstarten van 3.7 dev-versies",
        "fr": "améliorer la recherche d'entités EMS+ et EMS 2.0 (switchTimes & HolidayModes) avec télégrammes bruts\nsoutenir différents thermostats id\nmodifier les messages d'avertissement ems-esp en info sur le démarrage pour les versions 3.7 dev",
        "it": "migliorare la ricerca di EMS+ e EMS 2.0 entità (switchTimes & holidayModes) con telegrammi grezzi\nsupporto termostato diverso id\ncambiare messaggi di avviso ems-esp a info su start-up per 3.7 versioni di dev",
        "es": "mejorar la búsqueda de entidades EMS+ y EMS 2.0 (switchTimes & holidayModes) con telegramas crudos\nsoporte diferentes termostatos id\ncambiar ems-esp mensajes de advertencia a información sobre el inicio de 3.7 versiones dev",
        "pl": "ulepszenie wyszukiwania jednostek EMS + i EMS 2.0 (switchTimes & holidayModes) za pomocą surowych telegramów\nobsługa różnych termostatów id\nzmień ostrzeżenia ems- esp na informacje o start- up dla wersji 3.7 dev",
        "uk": "поліпшити пошук суб'єктів EMS+ і EMS 2.0 (switchTimes & HolidayModes) з сирими телеграмами\nпідтримка різних термостатів id\nзмінити повідомлення про попередження е-esp для отримання відомостей про початок версії 3.7 dev",
        "zh-cn": "改进对 EMS+ 和 EMS 2.0 实体的搜索( 开关时间和节假日模式) , 附带原始电报\n支持不同的自动调温器 id\n将 ems- esp 警告消息更改为3. 7 dev 版本的启动信息"
      },
      "4.2.0": {
        "en": "ems-esp: process double entity names between boiler and thermostat for dhw\nems-esp: add original device name to iobroker object name when km200-structure is selected",
        "de": "ems-esp: doppelte entitätsnamen zwischen kessel und thermostat für dhw verarbeiten\nems-esp: fügen sie dem iobroker objektnamen den ursprünglichen gerätenamen hinzu, wenn km200-struktur ausgewählt wird",
        "ru": "ems-esp: двойные названия между котелом и термостатом для dhw\nems-esp: добавить оригинальное название устройства к имени объекта iobroker, когда выбрана структура km200",
        "pt": "ems-esp: processar nomes de entidades duplas entre caldeira e termostato para dhw\nems-esp: adicione o nome original do dispositivo ao nome do objeto iobroker quando a estrutura km200 é selecionada",
        "nl": "ems-esp: naam van dubbele entiteit tussen ketel en thermostaat voor dhw\nems-esp: oorspronkelijke apparaatnaam toevoegen aan iobroker-objectnaam wanneer km200-structuur is geselecteerd",
        "fr": "ems-esp: procédé à double nom d'entité entre chaudière et thermostat pour dhw\nems-esp: ajouter le nom d'origine de l'appareil au nom de l'objet iobroker lorsque la structure km200 est sélectionnée",
        "it": "ems-esp: processo doppio entità nomi tra caldaia e termostato per dhw\nems-esp: aggiungi il nome originale del dispositivo al nome dell'oggetto iobroker quando viene selezionata la struttura km200",
        "es": "ems-esp: procesar nombres de entidad doble entre caldera y termostato para dhw\nems-esp: añadir el nombre original del dispositivo al nombre del objeto iobroker cuando se selecciona",
        "pl": "ems- esp: przetwarzanie podwójnych nazw jednostek między kotłem a termostatem dla dhw\nems- esp: dodaj oryginalną nazwę urządzenia do nazwy obiektu iobroker, gdy wybrana jest struktura km200-",
        "uk": "ems-esp: обробляти подвійні імена суб'єктів господарювання між котлом і термостатом для dhw\nems-esp: додати назву оригінального пристрою до назви об'єкта iobroker при км200-структурі",
        "zh-cn": "ems-esp: dhw 锅炉和恒温器之间处理双实体名称\nems- esp: 选择 km200 架构时将原始设备名称添加到 iobroster 对象名称"
      },
      "4.1.3": {
        "en": "fix crash on wrong ems-esp ip address",
        "de": "crash auf falsche ems-esp ip adresse beheben",
        "ru": "исправить крушение на неправильный адрес ems-esp",
        "pt": "corrigir acidente no endereço ems-esp ip errado",
        "nl": "fix crash op verkeerde ems-esp ip adres",
        "fr": "correction de l'écrasement sur la mauvaise adresse ems-esp ip",
        "it": "fissare l'incidente sull'indirizzo ems-esp ip sbagliato",
        "es": "arreglar fallo en la dirección equivocada ems-esp ip",
        "pl": "naprawić awarię na złym adresie ems- esp ip",
        "uk": "виправлення аварійної аварії на неправильній е-esp ip-адресі",
        "zh-cn": "固定错误的 ems- esp ip 地址上的崩溃"
      },
      "4.1.2": {
        "en": "km200 private password might has to be re-entered\nupdate dependencies (dependabot)",
        "de": "km200 privates passwort muss neu eingesehen werden\naktualisierung abhängigkeiten (dependabot)",
        "ru": "частный пароль km200 может быть повторно введен\nобновление зависимостей (dependabot)",
        "pt": "km200 senha privada pode ter que ser reentrada\ndependências de atualização (dependabot)",
        "nl": "km200 privé-wachtwoord moet mogelijk opnieuw ingevoerd worden\nafhankelijkheden bijwerken (dependabot)",
        "fr": "km200 mot de passe privé peut devoir être réintroduit\nmettre à jour les dépendances (dependabot)",
        "it": "km200 password privata potrebbe essere rientro\naggiornamento dipendenze (dependabot)",
        "es": "km200 contraseña privada podría tener que volver a entrar\ndependencias de actualización (dependabot)",
        "pl": "km200 prywatne hasło może być wprowadzone ponownie\naktualizacji zależności (zależności)",
        "uk": "km200 приватний пароль може бути перероблений\nоновлення залежностей",
        "zh-cn": "km200 私人密码可能要重新输入\n更新依赖性( 依赖性)"
      }
    },
    "titleLang": {
      "en": "EMS-ESP (ems-esp & km200)",
      "de": "EMS-ESP (ems-esp & km200)",
      "ru": "EMS-ESP (ems-esp и km200)",
      "pt": "EMS-ESP (ems-esp & km200)",
      "nl": "EMS-ESP (ems-esp & km200)",
      "fr": "EMS-ESP (EMS-ESP & km200)",
      "it": "EMS-ESP (ems-esp e km200)",
      "es": "EMS-ESP (ems-esp y km200)",
      "pl": "EMS-ESP (ems-esp i km200)",
      "uk": "EMS-ESP (ems-esp & км200)",
      "zh-cn": "EMS-ESP (ems-esp & km200)"
    },
    "desc": {
      "en": "EMS (Energy Management System) based equipment from manufacturers like Bosch, Buderus, Nefit, Junkers, Worcester and Sieger.",
      "de": "EMS (Energy Management System) basierte Geräte von Herstellern wie Bosch, Buderus, Nefit, Junkers, Worcester und Sieger.",
      "ru": "Оборудование на базе EMS (системы управления энергопотреблением) от таких производителей, как Bosch, Buderus, Nefit, Junkers, Worcester и Sieger.",
      "pt": "Equipamentos baseados em EMS (Sistema de Gerenciamento de Energia) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "nl": "Op EMS (Energy Management System) gebaseerde apparatuur van fabrikanten als Bosch, Buderus, Nefit, Junkers, Worcester en Sieger.",
      "fr": "Équipements basés sur EMS (Energy Management System) de fabricants tels que Bosch, Buderus, Nefit, Junkers, Worcester et Sieger.",
      "it": "Apparecchiature basate su EMS (Energy Management System) di produttori come Bosch, Buderus, Nefit, Junkers, Worcester e Sieger.",
      "es": "Equipos basados en EMS (Energy Management System) de fabricantes como Bosch, Buderus, Nefit, Junkers, Worcester y Sieger.",
      "pl": "Sprzęt oparty na EMS (Energy Management System) takich producentów jak Bosch, Buderus, Nefit, Junkers, Worcester i Sieger.",
      "uk": "EMS (Система енергоменеджменту) на основі обладнання від виробників, таких як Bosch, Buderus, Nefit, Junkers, Worcester та Sieger.",
      "zh-cn": "来自 Bosch、Buderus、Nefit、Junkers、Worcester 和 Sieger 等制造商的基于 EMS（能源管理系统）的设备。"
    },
    "authors": [
      "Thomas Petrick <tp1degit@gmail.com>"
    ],
    "keywords": [
      "ems-esp",
      "Buderus",
      "Bosch",
      "Junkers",
      "Netfit",
      "Sieger",
      "Worcester",
      "km200",
      "central heating",
      "smarthome"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "stopBeforeUpdate": true,
    "platform": "Javascript/Node.js",
    "tier": 2,
    "icon": "ems-esp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/tp1de/ioBroker.ems-esp/main/admin/ems-esp.png",
    "readme": "https://github.com/tp1de/ioBroker.ems-esp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "connectionType": "local",
    "stopTimeout": 1000,
    "dataFolder": "ems-esp.%INSTANCE%",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=4.0.24"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.13.16"
      }
    ],
    "encryptedNative": [
      "private_pw"
    ],
    "protectedNative": [
      "private_pw"
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<4.1.2",
            "newVersion>=4.0.2"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "This update contains a breaking change. Please stop instance before installing and check parameters afterwards.",
          "de": "Dieses Update enthält ein Breaking Change. Bitte stoppen Sie die Instanz vor der Installation und überprüfen Sie die Parameter danach.",
          "ru": "Это обновление содержит нарушающие изменения. Пожалуйста, остановите экземпляр перед установкой и проверьте параметры после.",
          "pt": "Esta atualização contém uma mudança de ruptura. Por favor, pare a instância antes de instalar e verificar os parâmetros depois.",
          "nl": "Deze update bevat een breuk verandering. Stop instance voor het installeren en controleer parameters achteraf.",
          "fr": "Cette mise à jour contient un changement de rupture. Veuillez arrêter l'instance avant d'installer et vérifier les paramètres après.",
          "it": "Questo aggiornamento contiene un cambiamento di rottura. Si prega di interrompere l'istanza prima di installare e controllare i parametri in seguito.",
          "es": "Esta actualización contiene un cambio de ruptura. Por favor deje de ejemplo antes de instalar y comprobar los parámetros después.",
          "pl": "Ta aktualizacja zawiera przełomową zmianę. Proszę zatrzymać instancję przed instalacją i sprawdzić parametry później.",
          "uk": "Цей оновлення містить зміни розриву. Будь ласка, припиніть екземпляр перед установкою і перевірте параметри після.",
          "zh-cn": "此更新包含一个突破性的更改 。 在安装之前请停止实例, 并在之后检查参数 ."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "private_pw": "",
    "control_file": "*",
    "km200_active": false,
    "km200_ip": "http://192.168.178.x",
    "km200_polling": 300,
    "km200_entry": "",
    "gateway_pw": "",
    "emsesp_active": true,
    "emsesp_ip": "http://ems-esp",
    "ems_apiv3": true,
    "ems_http_wait": 100,
    "ems_poll_wait": 500,
    "ems_token": "",
    "ems_polling": 60,
    "ems_dallas": false,
    "ems_dallas_old_format": false,
    "ems_analog": false,
    "ems_custom": false,
    "ems_custom_elements": false,
    "ems_energy": false,
    "ems_nominalpower": 15,
    "ems_modulation": "boiler.curburnpow",
    "ems_wwactive": "boiler.wwcharging",
    "recordings": false,
    "recordings_format": 0,
    "r_multi": 1,
    "r_month": true,
    "r_c": true,
    "statistics": false,
    "db": "",
    "db_instance": 0,
    "database": "iobroker",
    "km200_structure": false,
    "eff_active": false,
    "eff20": 109.4,
    "eff25": 109.3,
    "eff30": 108.3,
    "eff35": 108,
    "eff40": 106.5,
    "eff45": 105.2,
    "eff50": 103,
    "eff55": 100,
    "eff60": 98,
    "eff70": 97,
    "syslog": false,
    "syslog_port": 20516,
    "states_reorg": false,
    "heatdemand": false,
    "modulation": "",
    "supplytemp": "",
    "returntemp": "",
    "room": "boiler_room",
    "function": "heating",
    "devices": []
  },
  "objects": []
}
